# Contains Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroundConductorSizeSet..::..Contains Method
GroundConductorSizeSet Class See Also
---
Tests for the existence of a GroundConductorSize within the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	GroundConductorSize item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As GroundConductorSize _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	GroundConductorSize^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..GroundConductorSizeThe GroundConductorSize to be searched for.
# ### Return Value
The Contains method returns True if the GroundConductorSize is within the set, otherwise False.
# See Also
GroundConductorSizeSet Class
Autodesk.Revit.DB.Electrical Namespace